#  6. Account Balance

# Напишете програма, която пресмята колко общо пари има в сметката, след като направите определен брой вноски.
# На първия ред ще получите колко вноски трябва да се направят. На всеки следващ ред ще получавате сумата, която
#  трябва да внесете в сметката, докато не се достигне броя вноски. При всяка получена сума на конзолата трябва
# да се извежда "Increase: " + сумата и тя да се прибавя в сметката. Ако получите число по-малко от 0 на конзолата
#  трябва да се изведе "Invalid operation!" и програмата да приключи.
#  Когато програмата приключи трябва да се принтира "Total: " + общата сума в сметката закръглена до втория знак
# след десетичната запетая.

number_of_transaction = int(input())
counter_of_transaction = 0
result = 0

while counter_of_transaction < number_of_transaction:
    amount = float(input())

    if amount >= 0:
        result += amount
        print(f'Increase: {amount:.2f}')
    else:
        print('Invalid operation!')
        break

print(f'Total: {result:.2f}')