# 9. Moving

# На осемнадесетия си рожден ден на Хосе взел решение, че ще се изнесе да живее на квартира.
# Опаковал багажа си в кашони и намерил подходяща обява за апартамент под наем. Той започва да
# пренася своя багаж на части, защото не може да пренесе целия наведнъж. Има ограничено свободно
#  пространство в новото си жилище, където може да разположи вещите, така че мястото да бъде подходящо за живеене.
# Напишете програма, която изчислява свободния обем от жилището на Хосе, който остава след като пренесе багажа си.
# Бележка: Един кашон е с точни размери:  1m. x 1m. x 1m.
# Вход
# Потребителят въвежда следните данни на отделни редове:
# 1.	Широчина на свободното пространство - цяло число в интервала [1...1000]
# 2.	Дължина на свободното пространство - цяло число в интервала [1...1000]
# 3.	Височина на свободното пространство - цяло число в интервала [1...1000]
# 4.	На следващите редове (до получаване на команда "Done") - брой кашони, които се пренасят в квартирата -
# цели числа в интервала [1...10000];
# Програмата трябва да приключи прочитането на данни при команда "Done" или ако свободното място свърши.
# Изход
# Да се отпечата на конзолата един от следните редове:
# -	Ако стигнете до командата "Done" и има още свободно място:
# "{брой свободни куб. метри} Cubic meters left."
# -	Ако свободното място свърши преди да е дошла команда "Done":
# "No more free space! You need {брой недостигащи куб. метри} Cubic meters more."

width = int(input())
lenght = int(input())
height = int(input())

free_spaces = width * lenght * height

transported_box = input()
count_transported_box = 0

while not transported_box == 'Done':
    count_transported_box += int(transported_box)
    if count_transported_box >= free_spaces:
        break
    transported_box = input()

diff = free_spaces - count_transported_box

if diff >= 0:
    print(f"{diff} Cubic meters left.")
else:
    print(f'No more free space! You need {abs(diff)} Cubic meters more.')
